  &НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		// Массив для новых реквизитов
	//ДобавляемыеРеквизиты = Новый Массив;
	//// Опишем реквизиты формы                  
	//Реквизит_ПутевойЛист = Новый РеквизитФормы("бит_ПутевойЛист", Новый ОписаниеТипов("ДокументСсылка.бит_мат_ПутевойЛист"), "Объект.Товары", "ПутевойЛист");
	//
	//// Заполним массив после описания реквизитов формы
	//ДобавляемыеРеквизиты.Добавить(Реквизит_ПутевойЛист);
	//
	//// Добавим новые реквизиты на форму
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Вставить("Товарыргс_ПутевойЛист", Тип("ПолеФормы"), Элементы.Товары, Элементы.Товарыбит_мат_Склад);
	НовыйЭлемент.ПутьКДанным    = "Объект.Товары.ргс_ПутевойЛист";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Товарыргс_ПутевойЛистПриИзменении");
	
	ргс_УстановитьВидимость();
КонецПроцедуры

  &НаКлиенте
Процедура Товарыргс_ПутевойЛистПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.бит_мат_Склад = ргс_ПолучитьТехникуПутевогоЛиста(ТекДанные.ргс_ПутевойЛист);
	
КонецПроцедуры     

&НаСервере
Функция  ргс_ПолучитьТехникуПутевогоЛиста(Ссылка)
	Возврат бит_мат_ИнтеграцияАТ_СНиС_Сервер.СкладТехники(Ссылка.Техника);	
КонецФункции

&НаСервере
Процедура ргс_УстановитьВидимость();

	Элементы.ВидОперации.Видимость = бит_стр_СерверПовтИсп.ПолучитьЗначениеПеременной("бит_стр_ИспользуетсяМеханизация")
	ИЛИ (ЗначениеЗаполнено(Объект.ВидОперации) И Не Объект.ВидОперации = Перечисления.бит_стр_ВидыОперацииПеремещениеМеждуСкладами.ПеремещениеМеждуСкладами);
	ВидОперации = ?(ЗначениеЗаполнено(Объект.ВидОперации), Объект.ВидОперации, Перечисления.бит_стр_ВидыОперацииПеремещениеМеждуСкладами.ПеремещениеМеждуСкладами);
	
	Если ВидОперации = Перечисления.бит_стр_ВидыОперацииПеремещениеМеждуСкладами.бит_мат_ЗаправочнаяВедомость 
		Или ВидОперации = Перечисления.бит_стр_ВидыОперацииПеремещениеМеждуСкладами.бит_мат_СливТоплива Тогда
		Элементы.Товарыргс_ПутевойЛист.Видимость = Истина;
		
	Иначе
		Элементы.Товарыргс_ПутевойЛист.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
&После("ВидОперацииПриИзмененииНаСервере")
Процедура ргс_ВидОперацииПриИзмененииНаСервере()
	ргс_УстановитьВидимость();
КонецПроцедуры

