
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	бит_мат_СтроительнаяМеханизация.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);

	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.бит_мат_ВидыСтатусовПутевогоЛиста.Сформирован;
	КонецЕсли; 

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_мат_ЗаказНаТехнику") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, Ответственный, Комментарий, Подразделение, Объект, Регион");
		Заказчик 					= ДанныеЗаполнения.Контрагент;
        #Вставка
		ргс_ВнутреннийЗаказчик 		= ДанныеЗаполнения.ргс_ВнутреннийЗаказчик;
		#КонецВставки
		ДатаВыезда 					= ДанныеЗаполнения.ДатаНачала;
		ДатаВозвращения 			= КонецДня(ДанныеЗаполнения.ДатаОкончания);

		ДатаПлановаяВыезда			= ДатаВыезда;
		ДатаПлановаяВозвращения		= ДатаВозвращения;

		Если ДанныеЗаполнения.ТребованияКТехнике.Количество() > 0 Тогда
			Техника	= ДанныеЗаполнения.ТребованияКТехнике[0].Техника;
		КонецЕсли;
		ДокументОснование			= ДанныеЗаполнения;

		ЗаполнитьПоЗаказамНаТехнику();
	КонецЕсли;

КонецПроцедуры
