
&НаСервере
&ИзменениеИКонтроль("ПриЧтенииНаСервере")
Процедура бит_ПриЧтенииНаСервере(ТекущийОбъект)

	ЗаполнитьКэшЗначений(бит_стр_КэшЗначений);

	бит_стр_ОМТС_Сервер.ПриЧтенииНаСервере(ТекущийОбъект, Объект, ЭтаФорма);
	бит_стр_ОМТС_КлиентСервер.РассчитатьСуммуВсегоПоСтрокамТоваров(Объект);
	бит_стр_ОМТС_КлиентСервер.ЗаполнитьПодвалТоваров(СуммаВсего, Объект);

	РассчитатьСуммуВсегоБухПоСтрокамТоваров();

	//bt_04_1129_suyy_130819_N
	//бит_стр_ОМТС_МеханизмСтатусовСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	Если Не бит_стр_КэшЗначений.ИспользоватьСТиС Тогда
		бит_стр_ОМТС_МеханизмСтатусовСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	КонецЕсли;
	//bt_04_1129_suyy_130819_K

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//bt_03_0000_kord_161018_N
	Если Объект.ВидОперации = Перечисления.бит_стр_ВидыОперацииПриходныйОрдер.бит_мат_Заправка Тогда
		УстановитьПутевойЛист();
	КонецЕсли;
    #Вставка
	Если Объект.ВидОперации = Перечисления.бит_стр_ВидыОперацииПриходныйОрдер.бит_мат_Заправка Тогда
	Элементы.Склад.Заголовок = "Техника";
	Иначе
	Элементы.Склад.Заголовок = "Склад";
	КонецЕсли;
	#КонецВставки
	бит_стр_ОМТС_Сервер.ЗаполнитьПризнакИспользованияХарактеристикиИСерииВСтроках(Объект, "ДенежныеДокументы");
	//bt_03_0000_kord_161018_K

КонецПроцедуры   

&НаКлиенте
&ИзменениеИКонтроль("ВидОперацииПриИзмененииНаКлиенте")
Процедура бит_ВидОперацииПриИзмененииНаКлиенте()

	Если Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииОтПоставщика Тогда
		Элементы.Контрагент.ОтметкаНезаполненного = Истина;
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Для Каждого Строка Из Объект.Товары Цикл
			Строка.ЗаказПоставщику = Неопределено;
		КонецЦикла;
	КонецЕсли;

	Если Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииПеремещение Тогда
		Элементы.ЗаданиеНаПеремещение.ОтметкаНезаполненного = Истина;
		Элементы.ЗаданиеНаПеремещение.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;

	Если  Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииОтПодотчетника ИЛИ
		Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииИзЭксплуатации Тогда
		Элементы.ФизическоеЛицо.ОтметкаНезаполненного = Истина;
		Элементы.ФизическоеЛицо.АвтоОтметкаНезаполненного = Истина;
	Иначе 
		Объект.ФизическоеЛицо = Неопределено;
	КонецЕсли;

	Если Объект.ВидОперации <> бит_стр_КэшЗначений.ВидОперацииОтПоставщика И
		Объект.ВидОперации <> бит_стр_КэшЗначений.ВидОперацииПеремещение Тогда
		Объект.ЗаданиеНаПеремещение = Неопределено;
	КонецЕсли;

	Если Не (Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииОтПоставщика Или
		Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииОтПодотчетника Или
		//bt_03_0000_kord_161018_N
		//Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииВозвратОтПодрядчика) Тогда
		Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииВозвратОтПодрядчика) Или
		Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииЗаправка Тогда
		//bt_03_0000_kord_161018_K
		Объект.Контрагент = Неопределено;
		Объект.ДоговорКонтрагента = Неопределено;
	КонецЕсли;
	#Вставка
	Если Объект.ВидОперации = бит_стр_КэшЗначений.ВидОперацииЗаправка Тогда
	Элементы.Склад.Заголовок = "Техника";
	Иначе
	Элементы.Склад.Заголовок = "Склад";
	КонецЕсли;
	#КонецВставки

	Если Объект.ВидОперации <> бит_стр_КэшЗначений.ВидОперацииИзлишки Тогда
		Объект.ИнвентаризацияМПЗ = Неопределено;
	КонецЕсли;


КонецПроцедуры


