
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	бит_стр_ОМТС_Сервер.ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка, ЭтотОбъект);

	//bt_4000_suyy_200614_N             
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_стр_ПриходныйОрдер") Тогда

		//bt_04_1138_suyy_050919_N
		ДокументОснование = ДанныеЗаполнения;
		//bt_04_1138_suyy_050919_K

		ДанныеТЧПО = Документы.бит_стр_ПриходныйОрдер.ПолучитьДанныеДляЗаполненияДокументаНаОснованииТабличнойЧастиПриходногоОрдера(ДанныеЗаполнения, "ЯчейкаОтправитель");

		Если ДанныеТЧПО <> Неопределено Тогда

			Выгрузка = ДанныеТЧПО.Выгрузить();
			Товары.Загрузить(Выгрузка);

			СкладОтправитель = Выгрузка[0].Склад;

		КонецЕсли;


	КонецЕсли;
	//bt_4000_suyy_200614_K

	//bt_03_1598_kord_161018_N
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("бит_мат_ИзПутевогоЛиста") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);

			ВидОперации = Перечисления.бит_стр_ВидыОперацииПеремещениеМеждуСкладами.бит_мат_ЗаправочнаяВедомость;

			СкладТехника = Неопределено;
			Если ДанныеЗаполнения.Свойство("Техника") Тогда
				СкладТехника = бит_мат_ИнтеграцияАТ_СНиС_Сервер.СкладТехники(ДанныеЗаполнения.Техника);
				#Вставка
				ПутевойЛист = ДанныеЗаполнения.ПутевойЛист;
				#КонецВставки
			КонецЕсли; 

			ФизическоеЛицо = Неопределено;
			Если ДанныеЗаполнения.Свойство("ФизическоеЛицо") Тогда
				ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;	
			КонецЕсли; 

			Номенклатура = Неопределено;
			Если ДанныеЗаполнения.Свойство("Номенклатура") Тогда
				Номенклатура = ДанныеЗаполнения.Номенклатура;	
			КонецЕсли; 


			НовСтр = Товары.Добавить();
			#Вставка
			НовСтр.ргс_ПутевойЛист = ПутевойЛист;
			#КонецВставки
			НовСтр.бит_мат_Склад = СкладТехника;
			НовСтр.бит_мат_ФизическоеЛицо = ФизическоеЛицо;

			Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				НовСтр.Номенклатура = Номенклатура;
				НовСтр.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
				НовСтр.Коэффициент = 1;
			КонецЕсли;


		КонецЕсли;

	КонецЕсли;
	//bt_03_1598_kord_161018_K

КонецПроцедуры
