&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент 				= Элементы.Добавить("ргс_ВнутреннийЗаказчик", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_ВнутреннийЗаказчик";
	НовыйЭлемент.Заголовок		= "Внутренний заказчик";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент 				= Элементы.Добавить("ргс_Механик", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_Механик";
	НовыйЭлемент.Заголовок		= "Механик";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;

	НовыйЭлемент 				= Элементы.Добавить("ргс_Диспетчер", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_Диспетчер";
	НовыйЭлемент.Заголовок		= "Диспетчер";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода; 

	НовыйЭлемент 				= Элементы.Добавить("ргс_Смена", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_Смена";
	НовыйЭлемент.Заголовок		= "Смена";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода; 

	НовыйЭлемент 				= Элементы.Добавить("ргс_СпособОтраженияЗатрат", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_СпособОтраженияЗатрат";
	НовыйЭлемент.Заголовок		= "Способ отражения затрат";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;

	НовыйЭлемент 				= Элементы.Добавить("ргс_ПутевыеЛистыСозданы", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_ПутевыеЛистыСозданы";
	НовыйЭлемент.Заголовок		= "Путевые листы созданы";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_ВидыСообщенияТехники", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_ВидыСообщенияТехники";
	НовыйЭлемент.Заголовок		= "Виды сообщения техники";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
			
	НовыйЭлемент 				= Элементы.Вставить("ргс_ВидПеревозки", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_ВидПеревозки";
	НовыйЭлемент.Заголовок		= "Вид перевозки";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_Маршрут", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_Маршрут";
	НовыйЭлемент.Заголовок		= "Маршрут";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_ВремяПрибытия", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_ВремяПрибытия";
	НовыйЭлемент.Заголовок		= "Время прибытия";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_ВремяУбытия", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_ВремяУбытия";
	НовыйЭлемент.Заголовок		= "Время убытия";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода; 
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_Водитель", Тип("ПолеФормы"), Элементы.ТребованияКТехнике, Элементы.ТребованияКТехникеСодержание); 
	НовыйЭлемент.ПутьКДанным    = "Объект.ТребованияКТехнике.ргс_Водитель";
	НовыйЭлемент.Заголовок		= "Водитель";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВидОперацииПриИзмененииПосле(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_мат_ВидыОперацийЗаказНаТехнику.НаПериод") Тогда
		
		Элементы.ргс_ВнутреннийЗаказчик.Видимость 		= Истина;
		Элементы.ргс_Механик.Видимость 					= Истина;
		Элементы.ргс_Диспетчер.Видимость 				= Истина; 
		
		Элементы.ргс_Смена.Видимость 					= Истина;
		Элементы.ргс_СпособОтраженияЗатрат.Видимость 	= Истина;	
		Элементы.ргс_ПутевыеЛистыСозданы.Видимость 		= Ложь; 
		
		Элементы.ТребованияКТехнике.Доступность = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура бит_ТребованияКТехникеТехникаПриИзмененииПосле(Элемент) 
	
	ОчиститьСообщения(); 
	ПроверитьДатыЭксплуатации1();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДатыЭксплуатации1()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");	
	ЕстьОшибки = ДокументОбъект.ПроверитьДатыЭксплуатации();                                                
	Если ЕстьОшибки Тогда
		Возврат;	
	КонецЕсли;
КонецПроцедуры
