
&НаСервере
&ИзменениеИКонтроль("бит_мат_ТехникаСоздатьПерейтиЗавершениеНаСервере")
Функция бит_бит_мат_ТехникаСоздатьПерейтиЗавершениеНаСервере()

	НачатьТранзакцию();
	Попытка
		ТехникаОбъект = Справочники.бит_мат_Техника.СоздатьЭлемент();
		ТехникаОбъект.Наименование = Объект.Наименование;
		ТехникаОбъект.ЗаводскойНомер = Объект.ЗаводскойНомер;
		ТехникаОбъект.ДатаВыпуска = Объект.ДатаВыпуска;
		ТехникаОбъект.ПорядокИспользования = Перечисления.бит_мат_ПорядокИспользованияТехники.Самостоятельно;
		#Вставка
		ТехникаОбъект.ПервоначальнаяСтоимость = ПервоначальнаяСтоимостьБУ;
		Если СчетУчетаБУ = "01.01" Тогда	
		ТехникаОбъект.ТипСобственности = Перечисления.бит_мат_ТипыСобственности.ВСобственности;
		Иначе
		ТехникаОбъект.ТипСобственности = Перечисления.бит_мат_ТипыСобственности.Аренда;
		КонецЕсли;
		ТехникаОбъект.ДатаВводаВЭксплуатацию = ПринятоКУчетуБУ;
		//ЭтотОбъект["МОЛ"] = МОЛБУ;
		#КонецВставки
		ТехникаОбъект.Записать();

		Объект.бит_мат_Техника = ТехникаОбъект.Ссылка;
		Записать();

		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

КонецФункции
