
&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, Режим)
	Отказ = ПроверитьДатыЭксплуатации();
КонецПроцедуры

Функция ПроверитьДатыЭксплуатации() Экспорт
	ЕстьОшибки = Ложь;
	Для Каждого текСтрока Из ЭтотОбъект.ТребованияКТехнике Цикл
		Если НЕ (ЗначениеЗаполнено(текСтрока.Техника.ДатаВводаВЭксплуатацию)) ИЛИ текСтрока.Техника.ДатаВводаВЭксплуатацию > ТекущаяДата() Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В строке %1 техника %2 еще не введена в эксплуатацию", текСтрока.НомерСтроки, текСтрока.Техника);
			Сообщение.Поле = "ТребованияКТехнике[" + (текСтрока.НомерСтроки - 1) + "].Техника";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();  
			
			ЕстьОшибки = Истина;	
		ИначеЕсли ЗначениеЗаполнено(текСтрока.Техника.ДатаСнятияСУчета) И текСтрока.Техника.ДатаСнятияСУчета <= ТекущаяДата() Тогда  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В строке %1 техника %2 снята с учета", текСтрока.НомерСтроки, текСтрока.Техника);
			Сообщение.Поле = "ТребованияКТехнике[" + (текСтрока.НомерСтроки - 1) + "].Техника";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();  
			
			ЕстьОшибки = Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&После("ПриКопировании")
Процедура бит_ПриКопировании(ОбъектКопирования)
	ргс_ПутевыеЛистыСозданы = Ложь
КонецПроцедуры
