
&НаКлиенте
&ИзменениеИКонтроль("СоздатьЗаправочнуюВедомостьДействия")
Процедура бит_СоздатьЗаправочнуюВедомостьДействия(РезультатВопроса, ДополнительныеПараметры)

	лПараметры = Новый Структура("ЗакрыватьПриЗакрытииВладельца", Истина);
	//bt_03_1598_kord_161018_N
	//ЗначенияЗаполнения = Новый Структура("Техника", Объект.Техника);
	//
	//ЗначенияЗаполнения.Вставить("Организация", 		Объект.Организация);
	//ЗначенияЗаполнения.Вставить("Дата", 			Мин(Объект.ДатаВыезда + 300, Объект.Дата));
	//ЗначенияЗаполнения.Вставить("Подразделение", 	Объект.Подразделение);
	//ЗначенияЗаполнения.Вставить("Объект", 			Объект.Объект);
	//
	//ЗначенияЗаполнения.Вставить("Вид", 				ПредопределенноеЗначение("Перечисление.бит_мат_ВидыЗаправочныхВедомостей.СтационарнаяАЗС"));
	//ЗначенияЗаполнения.Вставить("Физлицо", 			Объект.Водитель);
	//ЗначенияЗаполнения.Вставить("Номенклатура", 	мОсновнойВидТоплива);
	//
	//ЗначенияЗаполнения.Вставить("ПутевойЛист", 		Объект.Ссылка);
	//ЗначенияЗаполнения.Вставить("ВалютаДокумента", 	бит_мат_АвтотранспортВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	//
	//лПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//
	//ОткрытьФорму("Документ.бит_мат_ЗаправочнаяВедомость.ФормаОбъекта", лПараметры, Элементы.Заправки, ЭтаФорма.УникальныйИдентификатор);

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("бит_мат_ИзПутевогоЛиста", Истина);

	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	#Вставка
	ЗначенияЗаполнения.Вставить("ПутевойЛист", Объект.Ссылка);
	#КонецВставки
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ЗначенияЗаполнения.Вставить("Техника", Объект.Техника);
	ЗначенияЗаполнения.Вставить("Дата", Мин(Объект.ДатаВыезда + 300, Объект.Дата));
	ЗначенияЗаполнения.Вставить("ФизическоеЛицо", Объект.Водитель);
	ЗначенияЗаполнения.Вставить("бит_мат_МОЛ", Объект.Водитель);
	ЗначенияЗаполнения.Вставить("Номенклатура", мОсновнойВидТоплива);

	лПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);

	ОткрытьФорму("Документ.бит_стр_ПеремещениеМеждуСкладами.ФормаОбъекта", лПараметры, Элементы.Заправки, ЭтаФорма.УникальныйИдентификатор);
	//bt_03_1598_kord_161018_K

КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_ВнутреннийЗаказчик", Тип("ПолеФормы"), Элементы.ГруппаОсновнаяПравая, Элементы.ДоговорКонтрагента);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_ВнутреннийЗаказчик";
	НовыйЭлемент.Заголовок		= "Внутренний заказчик";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	
	Элементы.ФормаДокументОбработан.Видимость = Ложь;
	
КонецПроцедуры                                               
