
&НаСервере
Процедура ргс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_ОсновнаяФормаПутевогоЛиста", Тип("ПолеФормы"), Элементы.Основная, Элементы.ГруппаГараж);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_ОсновнаяФормаПутевогоЛиста";
	НовыйЭлемент.Заголовок		= "Основная форма путевого листа";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость		= Истина;
	
	НовыйЭлемент 				= Элементы.Вставить("ргс_МОЛБУ", Тип("ПолеФормы"), Элементы.ГруппаУчетныеДанные, Элементы.ГруппаВводВЭкплуатацию);
	НовыйЭлемент.ПутьКДанным    = "Объект.ргс_МОЛБУ";
	НовыйЭлемент.Заголовок		= "МОЛ(БУ)";
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость		= Истина; 
КонецПроцедуры
